{
  "parameters": {
    "api-version": "2017-08-01-preview",
    "subscriptionId": "20ff7fc3-e762-44dd-bd96-b71116dcdc23",
    "resourceGroupName": "MyGroup",
    "solutionName": "default",
    "aggregatedAlertName": "IoT_Bruteforce_Fail/2019-02-02"
  },
  "responses": {
    "200": {
      "body": {
        "id": "/subscriptions/20ff7fc3-e762-44dd-bd96-b71116dcdc23/resourceGroups/MyGroup/providers/Microsoft.Security/IoTSecuritySolutions/Locations/eastus/default/IoT_Bruteforce_Fail/2019-02-02",
        "name": "/subscriptions/20ff7fc3-e762-44dd-bd96-b71116dcdc23/resourceGroups/MyGroup/providers/Microsoft.Security/IoTSecuritySolutions/Locations/eastus/default/IoT_Bruteforce_Fail/2019-02-02",
        "type": "Microsoft.Security/IoTSecurityAggregatedAlert",
        "properties": {
          "alertType": "IoT_Bruteforce_Fail",
          "alertDisplayName": "Failed Bruteforce",
          "aggregatedDateUtc": "2019-02-02",
          "vendorName": "Microsoft",
          "reportedSeverity": "Low",
          "remediationSteps": "",
          "description": "Multiple unsuccsseful login attempts identified. A Bruteforce attack on the device failed.",
          "count": 50,
          "effectedResourceType": "IoT Device",
          "systemSource": "Devices",
          "actionTaken": "Detected",
          "logAnalyticsQuery": "SecurityAlert | where tolower(ResourceId) == tolower('/subscriptions/b77ec8a9-04ed-48d2-a87a-e5887b978ba6/resourceGroups/IoT-Solution-DemoEnv/providers/Microsoft.Devices/IotHubs/rtogm-hub') and tolower(AlertName) == tolower('Custom Alert - number of device to cloud messages in MQTT protocol is not in the allowed range') | extend DeviceId=parse_json(ExtendedProperties)['DeviceId'] | project DeviceId, TimeGenerated, DisplayName, AlertSeverity, Description, RemediationSteps, ExtendedProperties"
        }
      }
    }
  }
}
