{
  "parameters": {
    "api-version": "2025-09-01",
    "bookmark": {
      "etag": "\"0300bf09-0000-0000-0000-5c37296e0000\"",
      "properties": {
        "created": "2019-01-01T13:15:30Z",
        "createdBy": {
          "objectId": "2046feea-040d-4a46-9e2b-91c2941bfa70"
        },
        "displayName": "My bookmark",
        "labels": [
          "Tag1",
          "Tag2"
        ],
        "notes": "Found a suspicious activity",
        "query": "SecurityEvent | where TimeGenerated > ago(1d) and TimeGenerated < ago(2d)",
        "queryResult": "Security Event query result",
        "updated": "2019-01-01T13:15:30Z",
        "updatedBy": {
          "objectId": "2046feea-040d-4a46-9e2b-91c2941bfa70"
        }
      }
    },
    "bookmarkId": "73e01a99-5cd7-4139-a149-9f2736ff2ab5",
    "operationalInsightsResourceProvider": "Microsoft.OperationalInsights",
    "resourceGroupName": "myRg",
    "subscriptionId": "d0cfe6b2-9ac0-4464-9919-dccaee2e48c0",
    "workspaceName": "myWorkspace"
  },
  "responses": {
    "200": {
      "body": {
        "name": "73e01a99-5cd7-4139-a149-9f2736ff2ab5",
        "type": "Microsoft.SecurityInsights/bookmarks",
        "etag": "\"0300bf09-0000-0000-0000-5c37296e0000\"",
        "id": "/subscriptions/d0cfe6b2-9ac0-4464-9919-dccaee2e48c0/resourceGroups/myRg/providers/Microsoft.OperationalInsights/workspaces/myWorkspace/providers/Microsoft.SecurityInsights/bookmarks/73e01a99-5cd7-4139-a149-9f2736ff2ab5",
        "properties": {
          "created": "2019-01-01T13:15:30Z",
          "createdBy": {
            "name": "john doe",
            "email": "john@contoso.com",
            "objectId": "2046feea-040d-4a46-9e2b-91c2941bfa70"
          },
          "displayName": "My bookmark",
          "labels": [
            "Tag1",
            "Tag2"
          ],
          "notes": "Found a suspicious activity",
          "query": "SecurityEvent | where TimeGenerated > ago(1d) and TimeGenerated < ago(2d)",
          "queryResult": "Security Event query result",
          "updated": "2019-01-01T13:15:30Z",
          "updatedBy": {
            "name": "john doe",
            "email": "john@contoso.com",
            "objectId": "2046feea-040d-4a46-9e2b-91c2941bfa70"
          }
        }
      }
    },
    "201": {
      "body": {
        "name": "73e01a99-5cd7-4139-a149-9f2736ff2ab5",
        "type": "Microsoft.SecurityInsights/bookmarks",
        "etag": "\"0300bf09-0000-0000-0000-5c37296e0000\"",
        "id": "/subscriptions/d0cfe6b2-9ac0-4464-9919-dccaee2e48c0/resourceGroups/myRg/providers/Microsoft.OperationalInsights/workspaces/myWorkspace/providers/Microsoft.SecurityInsights/bookmarks/73e01a99-5cd7-4139-a149-9f2736ff2ab5",
        "properties": {
          "created": "2019-01-01T13:15:30Z",
          "createdBy": {
            "name": "john doe",
            "email": "john@contoso.com",
            "objectId": "2046feea-040d-4a46-9e2b-91c2941bfa70"
          },
          "displayName": "My bookmark",
          "labels": [
            "Tag1",
            "Tag2"
          ],
          "notes": "Found a suspicious activity",
          "query": "SecurityEvent | where TimeGenerated > ago(1d) and TimeGenerated < ago(2d)",
          "queryResult": "Security Event query result",
          "updated": "2019-01-01T13:15:30Z",
          "updatedBy": {
            "name": "john doe",
            "email": "john@contoso.com",
            "objectId": "2046feea-040d-4a46-9e2b-91c2941bfa70"
          }
        }
      }
    }
  },
  "operationId": "Bookmarks_CreateOrUpdate",
  "title": "Creates or updates a bookmark."
}
