{
  "parameters": {
    "id": "7da626db-4731-4565-bda7-718a052f2219",
    "api-version": "2023-03-01-preview"
  },
  "responses": {
    "200": {
      "body": {
        "name": "Office",
        "products": [
          {
            "uniqueProductId": "WA104380756",
            "displayName": "Chiclet Slicer",
            "description": "The Chiclet Slicer was inspired by the great slicer control found in Excel since 2010, but with much greater customization options.\nChiclet are a slicers made of buttons, that can also be arranged horizontally for a very efficient real estate use, or arranged as a matrix for a super compact form.\nChiclet slicer also supports cross highlighting.\nThat's not all - they can even contain images!\n\nThis is an open source visual. Get the code from GitHub: https://github.com/Microsoft/PowerBI-visuals-chicletslicer",
            "summary": "Display image and/or text buttons that act as an in-canvas filter on other visuals",
            "smallIconUri": "https://store-images.s-microsoft.com/image/apps.24792.4d9575ab-e828-4cbf-9580-aa80ed6589ed.c5fe66d3-b95c-4a49-8194-cdd4e9a9c08f.6603d1c0-475a-464b-96cd-79aaf2fe15ff.png",
            "publisherDisplayName": "Microsoft Corporation",
            "productType": "PowerBIVisuals",
            "pricingTypes": [],
            "storeFronts": [
              "AppSource"
            ],
            "ratingAverage": 3.846,
            "id": "WA104380756"
          },
          {
            "uniqueProductId": "WA104381446",
            "displayName": "Calendly for Outlook",
            "description": "<p>Bring the power of scheduling right into Outlook</p><p>Finding a time to meet can be tedious, confusing (frustrating) and time-consuming. It doesn’t have to be. Calendly is a powerful yet simple scheduling tool that helps business professionals save time, control their schedule and delight invitees. When you add Calendly to Outlook, say goodbye to back-and-forth emails and schedule more of the meetings that matter.</p><p>**A Calendly account is required to take advantage of this add-in. If you aren’t already a user, please visit calendly.com and sign up for your free account.**</p><p>Top Benefits</p><p>Save time</p><p>Calendly’s scheduling link makes it easy for your invitees to find a time to meet and eliminates the need for back-and-forth emails.</p><p>Control your schedule</p><p>Create availability rules so even though your invitee picks the time, all your meetings will be scheduled at times that work best for you. </p><p>Convert better</p><p>Send your scheduling links at the height of someone’s interest with just a few clicks. Because of Calendly’s simple interface, get more of the meetings you want on the calendar quickly.</p><p>Top Features</p><p>Create a template for any types of meeting</p><p>Customize the meeting name, length of time, and when someone can schedule with you. Calendly’s advanced options let you ask questions before someone schedules, as well as create custom email and text reminders.</p><p>Protect your calendar from additional unprompted meetings</p><p>Share your availability without opening yourself up for unwanted meetings in the future. To better control incoming meetings, this option will generate a unique link associated with one of your event types. Once your invitee schedules, the link expires to restrict invitees from access in the future.</p><p>Generate a preview of times directly in email</p><p>You can select up to three days and this preview will show your invitee the first three available time slots of each of these days as buttons they can click. If those times don’t work for their schedule, they can still follow the included Calendly link and find another time that works better.</p><p>Select and share specific times to meet</p><p>Choose specific availability from your calendar, copy it to the clipboard and embed your selected time slots right into Outlook. This is perfect when you know exactly when you’d like to meet with someone or want to open up more availability for important contacts.</p><p>What are you waiting for?</p><p>Connect your Calendly account to Outlook today. If you aren’t already a member, sign up for a free account at calendly.com.</p>",
            "publisherDisplayName": "Calendly",
            "productType": "Office365",
            "storeFronts": [
              "AppSource"
            ],
            "ratingAverage": 4.787,
            "id": "WA104381446"
          },
          {
            "uniqueProductId": "WA104381309",
            "displayName": "Text Filter",
            "description": "Provides a search box that can be used to filter all other visuals on your dashboard with a text contains search on the field you specify. This enables you to quickly find specific content being shown on your dashboard by keyword search.  Entering a query term into the search box applies the search and using the eraser widget to the right will clear the current search.",
            "summary": "Search across your dataset right from the dashboard",
            "smallIconUri": "https://store-images.s-microsoft.com/image/apps.31077.33130f62-40d1-4489-ba5c-79a519519960.970d6959-bf92-4361-94da-638eb1ff5cef.c0de58cf-e494-4af1-bcf5-7b11fdf852e5.png",
            "publisherDisplayName": "Microsoft Corporation",
            "productType": "PowerBIVisuals",
            "pricingTypes": [],
            "storeFronts": [
              "AppSource"
            ],
            "ratingAverage": 4.159,
            "id": "WA104381309"
          }
        ],
        "id": "b0ccc6f7-bfb4-4638-8e86-e793f5b4ed84"
      }
    }
  }
}
