{
  "parameters": {
    "api-version": "2023-03-01-preview"
  },
  "responses": {
    "200": {
      "body": {
        "solutions": [
          {
            "name": "Starting Prices",
            "products": [
              {
                "uniqueProductId": "ntegralinc1586961136942.ntg_alma_linux_8_7_minimal",
                "displayName": "AlmaLinux 8.7 Minimal",
                "description": "<p>AlmaLinux 8.7 Minimal is a premier image designed by Ntegral optimized for production environments on Azure.  This VM provides the latest features available in AlmaLinux 8.7.</p>\n\n<p>Looking for additional security and compliance for your Linux production environment? Then look no further.</p>\n\n<p>AlmaLinux 8.7 Minimal for Azure is a premier Linux distro for enterprise cloud environments. AlmaLinux is an excellent virtual machine (VM) platform for all workloads that include Node.js, web applications and various database platforms. The purpose of AlmaLinux is to assist organizations and their clients with an easy path to upgrade or move from CentOS which reached EOL 12/31/2021.</p>\n\n<h3>Why use Ntegral Certified Apps?</h3>\n\n<p>Ntegral certified images are always up-to-date, secure, and built to work right out of the box.</p>\n\n<p>Ntegral packages applications following industry standards, and continuously monitors all components and libraries for vulnerabilities and application updates. When any security threat or update is identified, Ntegral automatically repackages the applications and pushes the latest versions to the cloud marketplaces.</p>\n\n<p><b>No contract needed: pay per hour</b></p>\n\n<p><b>Disclaimer:</b> The respective trademarks mentioned in the offering are owned by the respective companies. We do not provide commercial license of any of these products. Many of the products have a, demo or Open Source license as applicable.</p>",
                "summary": "AlmaLinux 8, RHEL 1:1, CentOS 8 alternative, AlmaLinux 8.7 Minimal packaged by Ntegral Inc for Azure",
                "smallIconUri": "https://store-images.s-microsoft.com/image/apps.51256.d9677393-a027-4aad-91f4-5e945fd05d12.f9e1ac27-eb3e-4eb6-a1cc-7b4083b55d23.e802b5e6-fd6b-4191-95e6-cdcf256d745d",
                "publisherDisplayName": "Ntegral Inc.",
                "productType": "VirtualMachine",
                "pricingTypes": [
                  "Ri",
                  "Payg"
                ],
                "storeFronts": [
                  "Azure Portal",
                  "Azure Marketplace"
                ],
                "ratingAverage": 0
              },
              {
                "uniqueProductId": "canonical.0001-com-ubuntu-server-bionic",
                "displayName": "Ubuntu Server 18.04 LTS",
                "description": "<span style=\"color:red\">\n<b>Ubuntu Server 18.04 LTS is reaching End Of Standard Support in April 2023. After this date, the operating system will stop receiving security and bug fixes. Please use a newer LTS version of Ubuntu or use <a href=\"https://azuremarketplace.microsoft.com/en-us/marketplace/apps/canonical.0001-com-ubuntu-pro-bionic?tab=Overview\">Ubuntu Pro 18.04</a>, which will continue to receive security and bug fixes up until April 2028.</b>\n<br>\nTo learn more about this: <a href=\"https://ubuntu.com/18-04/azure\">https://ubuntu.com/18-04/azure</a>\n\n</span>\n<br>\n<br>\nUbuntu Server for Azure is designed by Canonical and optimised for Azure. Ubuntu is the world’s most popular Linux and is suitable for small to large-scale Linux operations. For more information, see <a href=\"https://ubuntu.com/azure\">Ubuntu on Azure</a>.<br>\n<br>\n<h1>Why developers and devops choose Ubuntu Server for Azure</h1>\n<ul>\n  <li>Production ready: Ubuntu is the leading Linux in the public cloud with &gt; 50% of Linux workloads</li>\n  <li>Developer friendly: Ubuntu is the #1 Linux for developers offering the latest library and tools to innovate with the latest technologies</li>\n  <li>No mandatory licenses: Ubuntu Server is freely available, with no mandatory licenses and unlimited VMs</li>\n  <li>Portability: Ubuntu is available in all regions with content mirrors to avoid the need to go across regions or out to the Internet for updates</li>\n  <li>Free 5-year security maintenance: Ubuntu Server 18.04 LTS provides security maintenance until April 2023</li>\n</ul><br>\nFor professional and production environments or applications where additional security and compliance is needed or you want to continue using the environment beyond April 2023, read more about our professional version: <a href=\"https://azuremarketplace.microsoft.com/en-us/marketplace/apps/canonical.0001-com-ubuntu-pro-bionic?tab=Overview\">Ubuntu Pro 18.04</a>.\n",
                "summary": "Linux For The Cloud",
                "smallIconUri": "https://store-images.s-microsoft.com/image/apps.32072.42980428-8544-44b7-b493-3b6c3cdbfa01.d4a304f5-4472-4cb0-89ae-fb83cf2ff863.a4e390bd-8082-417e-8ca3-ca11cce0bc93",
                "publisherDisplayName": "Canonical",
                "productType": "VirtualMachine",
                "pricingTypes": [],
                "storeFronts": [
                  "Azure Portal",
                  "Azure Marketplace"
                ],
                "ratingAverage": 2.5
              }
            ],
            "id": "710fea3b-4a50-46e5-b2ad-95ed8423b61d"
          },
          {
            "name": "Office",
            "products": [
              {
                "uniqueProductId": "WA104380756",
                "displayName": "Chiclet Slicer",
                "description": "The Chiclet Slicer was inspired by the great slicer control found in Excel since 2010, but with much greater customization options.\nChiclet are a slicers made of buttons, that can also be arranged horizontally for a very efficient real estate use, or arranged as a matrix for a super compact form.\nChiclet slicer also supports cross highlighting.\nThat's not all - they can even contain images!\n\nThis is an open source visual. Get the code from GitHub: https://github.com/Microsoft/PowerBI-visuals-chicletslicer",
                "summary": "Display image and/or text buttons that act as an in-canvas filter on other visuals",
                "smallIconUri": "https://store-images.s-microsoft.com/image/apps.24792.4d9575ab-e828-4cbf-9580-aa80ed6589ed.c5fe66d3-b95c-4a49-8194-cdd4e9a9c08f.6603d1c0-475a-464b-96cd-79aaf2fe15ff.png",
                "publisherDisplayName": "Microsoft Corporation",
                "productType": "PowerBIVisuals",
                "pricingTypes": [],
                "storeFronts": [
                  "AppSource"
                ],
                "ratingAverage": 3.846
              }
            ],
            "id": "b0ccc6f7-bfb4-4638-8e86-e793f5b4ed84"
          }
        ],
        "id": "375a188a2b3619fd90e5921ea5f11a3ce1c3715f779746583bf5a88b92fa0c8f"
      }
    }
  }
}
