{
  "parameters": {
    "api-version": "2022-04-01-preview",
    "apiId": "echo-api"
  },
  "responses": {
    "200": {
      "body": {
        "value": [
          {
            "id": "create-resource",
            "name": "Create resource",
            "method": "POST",
            "urlTemplate": "/resource",
            "description": "A demonstration of a POST call based on the echo backend above. The request body is expected to contain JSON-formatted data (see example below). A policy is used to automatically transform any request sent in JSON directly to XML. In a real-world scenario this could be used to enable modern clients to speak to a legacy backend.",
            "request": null,
            "policies": null
          },
          {
            "id": "modify-resource",
            "name": "Modify Resource",
            "method": "PUT",
            "urlTemplate": "/resource",
            "description": "A demonstration of a PUT call handled by the same \"echo\" backend as above. You can now specify a request body in addition to headers and it will be returned as well.",
            "request": null,
            "policies": null
          },
          {
            "id": "remove-resource",
            "name": "Remove resource",
            "method": "DELETE",
            "urlTemplate": "/resource",
            "description": "A demonstration of a DELETE call which traditionally deletes the resource. It is based on the same \"echo\" backend as in all other operations so nothing is actually deleted.",
            "request": null,
            "policies": null
          },
          {
            "id": "retrieve-header-only",
            "name": "Retrieve header only",
            "method": "HEAD",
            "urlTemplate": "/resource",
            "description": "The HEAD operation returns only headers. In this demonstration a policy is used to set additional headers when the response is returned and to enable JSONP.",
            "request": null,
            "policies": null
          },
          {
            "id": "retrieve-resource",
            "name": "Retrieve resource",
            "method": "GET",
            "urlTemplate": "/resource",
            "description": "A demonstration of a GET call on a sample resource. It is handled by an \"echo\" backend which returns a response equal to the request (the supplied headers and body are being returned as received).",
            "request": null,
            "policies": null
          },
          {
            "id": "retrieve-resource-cached",
            "name": "Retrieve resource (cached)",
            "method": "GET",
            "urlTemplate": "/resource-cached",
            "description": "A demonstration of a GET call with caching enabled on the same \"echo\" backend as above. Cache TTL is set to 1 hour. When you make the first request the headers you supplied will be cached. Subsequent calls will return the same headers as the first time even if you change them in your request.",
            "request": null,
            "policies": null
          }
        ],
        "nextLink": null
      }
    }
  }
}
