{
  "parameters": {
    "api-version": "2019-01-01-preview",
    "subscriptionId": "d0cfe6b2-9ac0-4464-9919-dccaee2e48c0",
    "resourceGroupName": "myRg",
    "workspaceName": "myWorkspace",
    "operationalInsightsResourceProvider": "Microsoft.OperationalIinsights",
    "entityId": "73e01a99-5cd7-4139-a149-9f2736ff2ab5"
  },
  "responses": {
    "200": {
      "body": {
        "id": "/subscriptions/d0cfe6b2-9ac0-4464-9919-dccaee2e48c0/resourceGroups/myRg/providers/Microsoft.OperationalIinsights/workspaces/myWorkspace/providers/Microsoft.SecurityInsights/entities/73e01a99-5cd7-4139-a149-9f2736ff2ab5",
        "name": "73e01a99-5cd7-4139-a149-9f2736ff2ab5",
        "type": "Microsoft.SecurityInsights/entities",
        "kind": "Bookmark",
        "properties": {
          "friendlyName": "My bookmark",
          "displayName": "My bookmark",
          "created": "2019-01-01T13:15:30Z",
          "updated": "2019-01-01T13:15:30Z",
          "createdBy": {
            "objectId": "2046feea-040d-4a46-9e2b-91c2941bfa70",
            "email": "john@contoso.com",
            "name": "john doe"
          },
          "updatedBy": {
            "objectId": "2046feea-040d-4a46-9e2b-91c2941bfa70",
            "email": "john@contoso.com",
            "name": "john doe"
          },
          "eventTime": "2019-01-01T13:15:30Z",
          "notes": "Found a suspicious activity",
          "query": "SecurityEvent | where EventID=4688 | take 1",
          "queryResult": "QueryResult",
          "labels": [
            "Tag1",
            "Tag2"
          ]
        }
      }
    }
  }
}
